import React from "react";


const TermsOfUse = function(){
    return (
        <div className="row justify-content-center">
            <span className="col-10 mt-5">
                Пользовательское Соглашение
                Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между владельцем kirillzhosul.site (далее Kirill Zhosul или Администрация) с одной стороны и пользователем сайта с другой.
                Сайт Kirill Zhosul не является средством массовой информации.

                Используя сайт, Вы соглашаетесь с условиями данного соглашения.
                Если Вы не согласны с условиями данного соглашения, не используйте сайт Kirill Zhosul!

                Права и обязанности сторон
                Пользователь имеет право:
                - осуществлять поиск информации на сайте
                - получать информацию на сайте
                - копировать информацию на другие сайты с указанием источника

                Администрация имеет право:
                - по своему усмотрению и необходимости создавать, изменять, отменять правила
                - ограничивать доступ к любой информации на сайте
                - создавать, изменять, удалять информацию
                - удалять учетные записи
                - отказывать в регистрации без объяснения причин

                Пользователь обязуется:
                - не нарушать работоспособность сайта
                - не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами

                Администрация обязуется:
                - поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.
                - защищать информацию, распространение которой ограничено или запрещено законами путем вынесения предупреждения либо удалением учетной записи пользователя, нарушившего правила
                - предоставить всю доступную информацию о Пользователе уполномоченным на то органам государственной власти в случаях, установленных законом

                Ответственность сторон
                - пользователь лично несет полную ответственность за распространяемую им информацию
                - администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных услуг
                - администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами
                - в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса

                Условия действия Соглашения
                Данное Соглашение вступает в силу при любом использовании данного сайта.
                Соглашение перестает действовать при появлении его новой версии.
                Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.
                При изменении соглашения, в некоторых случаях, администрация может оповестить пользователей удобным для нее способом.
            </span>
        </div>
    )
}


export default TermsOfUse;